<?php
/***************************************************************************
*                                                                          *
*   © 2012 ООО "Эком Системы"                                              *
*                                                                          *
* Это коммерческое программное обеспечение. Только пользователи, которые   *
* приобрели действующую лицензию и согласились с условиями лицензионного   *
* соглашения, могут устанавливать и использовать эту программу.            *
*                                                                          *
****************************************************************************
* ПОЖАЛУЙСТА, ВНИМАТЕЛЬНО ПРОЧТИТЕ ПОЛНЫЙ ТЕКСТ ЛИЦЕНЗИОННОГО СОГЛАШЕНИЯ   *
* В ФАЙЛЕ "copyright.txt", ПРЕДОСТАВЛЕННОМ ВМЕСТЕ С ЭТИМ ДИСТРИБУТИВОМ.    *
***************************************************************************/

use Tygh\Enum\FiscalData1212Objects;

defined('BOOTSTRAP') or die('Access denied');

return [
    'recommended' => [
        FiscalData1212Objects::PAYMENT,
        FiscalData1212Objects::SERVICE,
    ],
    'other' => [
        FiscalData1212Objects::JOB,
        FiscalData1212Objects::AGENT_COMMISSION,
        FiscalData1212Objects::PAYOUT,
        FiscalData1212Objects::OTHER,
    ],
];
