<?php
/***************************************************************************
*                                                                          *
*   © 2012 ООО "Эком Системы"                                              *
*                                                                          *
* Это коммерческое программное обеспечение. Только пользователи, которые   *
* приобрели действующую лицензию и согласились с условиями лицензионного   *
* соглашения, могут устанавливать и использовать эту программу.            *
*                                                                          *
****************************************************************************
* ПОЖАЛУЙСТА, ВНИМАТЕЛЬНО ПРОЧТИТЕ ПОЛНЫЙ ТЕКСТ ЛИЦЕНЗИОННОГО СОГЛАШЕНИЯ   *
* В ФАЙЛЕ "copyright.txt", ПРЕДОСТАВЛЕННОМ ВМЕСТЕ С ЭТИМ ДИСТРИБУТИВОМ.    *
***************************************************************************/

$php_value = phpversion();
if (version_compare($php_value, '7.4.0', '<') || version_compare($php_value, '8.4.0', '>=')) {
    echo 'Your current PHP version ' . $php_value . ' isn\'t supported. CS-Cart supports PHP from 7.4 and up to (but not including) 8.4.0';
    die();
}

@include('run.php');

define('INSTALLER_STARTED', true);
